In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score

In [2]:
df=pd.read_csv('Social_Network_Ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [4]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [5]:
df_Gender=pd.get_dummies(df['Gender'],drop_first=True)

In [6]:
df_Gender

     Male
0       1
1       1
2       0
3       0
4       1
..    ...
395     0
396     1
397     0
398     1
399     0

[400 rows x 1 columns]

In [7]:
df=pd.concat([df,df_Gender],axis=1)

In [8]:
df.drop(['Gender'],axis=1,inplace=True)

In [9]:
df.head()

    User ID  Age  EstimatedSalary  Purchased  Male
0  15624510   19            19000          0     1
1  15810944   35            20000          0     1
2  15668575   26            43000          0     0
3  15603246   27            57000          0     0
4  15804002   19            76000          0     1

In [10]:
df.drop(['User ID'],axis=1,inplace=True)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Age              400 non-null    int64
 1   EstimatedSalary  400 non-null    int64
 2   Purchased        400 non-null    int64
 3   Male             400 non-null    uint8
dtypes: int64(3), uint8(1)
memory usage: 9.9 KB

In [12]:
x=df[['Age','EstimatedSalary','Male']]
y=df[['Purchased']]

In [13]:
x

     Age  EstimatedSalary  Male
0     19            19000     1
1     35            20000     1
2     26            43000     0
3     27            57000     0
4     19            76000     1
..   ...              ...   ...
395   46            41000     0
396   51            23000     1
397   50            20000     0
398   36            33000     1
399   49            36000     0

[400 rows x 3 columns]

In [14]:
y

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

##### Random Forest

In [15]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=1)

In [16]:
rf_model=RandomForestClassifier()

In [17]:
rf_model.fit(x_train,y_train)

<ipython-input-17-979f9d2be7c5>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  rf_model.fit(x_train,y_train)

RandomForestClassifier()

In [18]:
y_pred_rf=rf_model.predict(x_test)

In [19]:
y_pred_rf

array([0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1,
       1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1,
       0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [20]:
rf_score=accuracy_score(y_test,y_pred_rf)
rf_score

0.8375

#### Decision Tree

In [21]:
dt_model=DecisionTreeClassifier()

In [22]:
dt_model.fit(x_train,y_train)

DecisionTreeClassifier()

In [23]:
y_pred_dt=dt_model.predict(x_test)

In [24]:
dt_score=accuracy_score(y_test,y_pred_dt)
dt_score

0.7875

#### Logistic Regression

In [25]:
from sklearn.linear_model import LogisticRegression

In [26]:
lr_model=LogisticRegression()

In [27]:
lr_model.fit(x_train,y_train)

C:\Users\Shashree\anaconda3\lib\site-packages\sklearn\utils\validation.py:73: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

LogisticRegression()

In [28]:
y_pred_lr=lr_model.predict(x_test)
y_pred_lr

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], dtype=int64)

In [29]:
lr_score=accuracy_score(y_test,y_pred_lr)
lr_score

0.6

##### KNN

In [30]:
from sklearn.neighbors import  KNeighborsClassifier

In [31]:
knn_model= KNeighborsClassifier()

In [32]:
knn_model.fit(x_train,y_train)

<ipython-input-32-449ed2d435e2>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  knn_model.fit(x_train,y_train)

KNeighborsClassifier()

In [33]:
y_pred_knn=knn_model.predict(x_test)

In [34]:
score_knn=accuracy_score(y_test,y_pred_knn)

In [35]:
score_knn

0.75

##### Dump Model

In [36]:
import pickle
filename='model.pkl'
pickle.dump(rf_model,open(filename,'wb'))

In [37]:
load_model=pickle.load(open(filename,'rb'))

In [38]:
df.columns

Index(['Age', 'EstimatedSalary', 'Purchased', 'Male'], dtype='object')

In [40]:
df.rename(columns={'Male':'Gender'},inplace=True)

In [41]:
df.columns

Index(['Age', 'EstimatedSalary', 'Purchased', 'Gender'], dtype='object')